-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Фев 09 2021 г., 12:06
-- Версия сервера: 10.4.17-MariaDB
-- Версия PHP: 8.0.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `myshop`
--

-- --------------------------------------------------------

--
-- Структура таблицы `books`
--

CREATE TABLE `books` (
  `N` int(11) NOT NULL,
  `SomeCode` int(11) NOT NULL,
  `NEW` varchar(4) DEFAULT NULL,
  `NAME` varchar(150) NOT NULL,
  `Price` float NOT NULL,
  `Publishing_house` varchar(100) DEFAULT NULL,
  `Pages` smallint(6) DEFAULT NULL,
  `FORMAT` varchar(200) DEFAULT NULL,
  `Data1` datetime DEFAULT NULL,
  `Edition` int(11) DEFAULT NULL,
  `Theme` varchar(50) DEFAULT NULL,
  `Category` varchar(30) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `books`
--

INSERT INTO `books` (`N`, `SomeCode`, `NEW`, `NAME`, `Price`, `Publishing_house`, `Pages`, `FORMAT`, `Data1`, `Edition`, `Theme`, `Category`) VALUES
(2, 5111, 'No', 'Аппаратные средства мультимедия. Видеосистема РС', 15.51, 'BHV С.-Петербург', 400, '70х100/16', '2000-07-24 00:00:00', 5000, 'Використання ПК в цілому', 'Підручники'),
(8, 4985, 'No', 'Освой самостоятельно модернизацию и ремонт ПК за 24 часа, 2-е изд.', 18.9, 'Вильямс', 288, '70х100/16', '2000-07-07 00:00:00', 5000, 'Використання ПК в цілому', 'Підручники'),
(9, 5141, 'No', 'Структуры данных и алгоритмы.', 37.8, 'Вильямс', 384, '70х100/16', '2000-09-29 00:00:00', 5000, 'Використання ПК в цілому', 'Підручники'),
(20, 5127, 'Yes', 'Автоматизация инженерно- графических работ', 11.58, 'Питер', 256, '70х100/16', '2000-06-15 00:00:00', 5000, 'Використання ПК в цілому', 'Підручники'),
(31, 5110, 'No', 'Аппаратные средства мультимедия. Видеосистема РС', 15.51, 'BHV С.-Петербург', 400, '70х100/16', '2000-07-24 00:00:00', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(46, 5199, 'No', 'Железо IBM 2001. ', 30.07, 'МикроАрт', 368, '70х100/16', '2000-12-02 00:00:00', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
(50, 3851, 'Yes', 'Защита информации и безопасность компьютерных систем', 26, 'DiaSoft', 480, '84х108/16', '1999-02-04 00:00:00', 5000, 'Використання ПК в цілому', 'Захист і безпека ПК'),
(58, 3932, 'No', 'Как превратить персональный компьютер в измерительный комплекс', 7.65, 'ДМК', 144, '60х88/16', '1999-06-09 00:00:00', 5000, 'Використання ПК в цілому', 'Інші книги'),
(59, 4713, 'No', 'Plug- ins. Встраиваемые приложения для музыкальных программ', 11.41, 'ДМК', 144, '70х100/16', '2000-02-22 00:00:00', 5000, 'Використання ПК в цілому', 'Інші книги'),
(175, 5217, 'No', 'Windows МЕ. Новейшие версии программ', 16.57, 'Триумф', 320, '70х100/16', '2000-08-25 00:00:00', 5000, 'Операційні системи', 'Windows 2000'),
(176, 4829, 'No', 'Windows 2000 Professional шаг за шагом с СD', 27.25, 'Эком', 320, '70х100/16', '2000-04-28 00:00:00', 5000, 'Операційні системи', 'Windows 2000'),
(188, 5170, 'No', 'Linux Русские версии', 24.43, 'ДМК', 346, '70х100/16', '2000-09-29 00:00:00', 5000, 'Операційні системи', 'Linux'),
(191, 860, 'No', 'Операционная система UNIX', 3.5, 'BHV С.-Петербург', 395, '84х10016', '1997-05-05 00:00:00', 5000, 'Операційні системи', 'Unix'),
(203, 44, 'No', 'Ответы на актуальные вопросы по OS/2 Warp', 5, 'DiaSoft', 352, '60х84/16', '1996-03-20 00:00:00', 5000, 'Операційні системи', 'Інші операційні системи'),
(206, 5176, 'No', 'Windows Ме. Спутник пользователя', 12.79, 'Русская редакция', 306, '-', '2000-10-10 00:00:00', 5000, 'Операційні системи', 'Інші операційні системи'),
(209, 5462, 'No', 'Язык программирования С++. Лекции и упражнения', 29, 'DiaSoft', 656, '84х108/16', '2000-12-12 00:00:00', 5000, 'Програмування', 'C&C++'),
(210, 4982, 'No', 'Язык программирования С. Лекции и упражнения', 29, 'DiaSoft', 432, '84х108/16', '2000-07-12 00:00:00', 5000, 'Програмування', 'C&C++'),
(220, 4687, 'No', 'Эффективное использование C++ .50 рекомендаций по улучшению ваших программ и проектов', 17.6, 'ДМК', 240, '70х100/16', '2000-02-03 00:00:00', 5000, 'Програмування', 'C&C++');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`N`),
  ADD KEY `NameIndex` (`NAME`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
